'''
문제
세 개의 장대가 있고 첫 번째 장대에는 반경이 서로 다른 n개의 원판이 쌓여 있다. 각 원판은 반경이 큰 순서대로 쌓여있다. 이제 수도승들이 다음 규칙에 따라 첫 번째 장대에서 세 번째 장대로 옮기려 한다.

한 번에 한 개의 원판만을 다른 탑으로 옮길 수 있다.
쌓아 놓은 원판은 항상 위의 것이 아래의 것보다 작아야 한다.
이 작업을 수행하는데 필요한 이동 순서를 출력하는 프로그램을 작성하라. 단, 이동 횟수는 최소가 되어야 한다.

아래 그림은 원판이 5개인 경우의 예시이다.



입력
첫째 줄에 첫 번째 장대에 쌓인 원판의 개수 N (1 ≤ N ≤ 20)이 주어진다.

출력
첫째 줄에 옮긴 횟수 K를 출력한다.

두 번째 줄부터 수행 과정을 출력한다. 두 번째 줄부터 K개의 줄에 걸쳐 두 정수 A B를 빈칸을 사이에 두고 출력하는데, 이는 A번째 탑의 가장 위에 있는 원판을 B번째 탑의 가장 위로 옮긴다는 뜻이다.
'''

n = int(input())

# rod1, rod2, rod3 : 각 위치에 있는 장대의 번호
def hanoi(n, rod1, rod3, rod2):

    ## base case
    # 원판이 하나일 떄는 그냥 rod1 -> rod3으로 옮기면 끝난다.
    if n == 1: 
        print(rod1, rod3)
    
    ## recursion
    else:
        # 1. 원판 n-1개를 rod1에서 rod2로 옮긴다. (rod3를 보조 기둥으로)
        hanoi(n-1, rod1, rod2, rod3)

        # 2. n번째 원반 = 제일 밑에 있는 원판을 목적지(rod3)로 이동
        print(rod1, rod3)

        # 3. rod2(가운데 장대)에 있는 원반 n-1개를 목적지(rod3)로 이동 (rod1를 보조 기둥으로)
        hanoi(n-1, rod2, rod3, rod1)

# 테스트
print(2**n - 1)
hanoi(n, 1, 3, 2)